bouffalolab/bl808-pac/bl808.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Bouffalo Lab</vendor>
  <vendorID>bouffalolab</vendorID>
  <name>BL808</name>
  <series></series> <!-- todo -->
  <version>1.0</version>
  <description>Bouffalo BL808 chip</description>
  <licenseText>
    <!-- todo -->
  </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>64</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  
  <peripherals>
    <peripheral>
      <name>CODEC</name>
      <description>Codec miscellaneous control</description>
      <baseAddress>0x30020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MJPEG</name>
      <description>Motion JPEG encoder</description>
      <baseAddress>0x30021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>H264</name>
      <description>H.264 video codec control</description>
      <baseAddress>0x30022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- <peripheral>
      <name>MJDEC</name>
      <description>Motion JPEG decoder</description>
      <baseAddress>0x30023000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            
          </fields>
        </register>
      </registers>
    </peripheral> -->
    <peripheral>
      <name>NPU</name>
      <description>Bouffalo Convolutional Neural Network</description>
      <baseAddress>0x30024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MMGLB</name>
      <description>Multimedia Global controller</description>
      <baseAddress>0x30007000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- <peripheral derivedFrom="UART[%s]">
      <name>UART3</name>
      <baseAddress>0x30002000</baseAddress>
    </peripheral> -->
    <!-- todo: 0x24900000 RF_GLB? -->
    <!-- todo: 0x24910000 WIFI_MAC? -->
    <peripheral>
      <name>PTA</name>
      <description>Packet Traffic Arbitration</description>
      <baseAddress>0x24920000</baseAddress> <!-- todo: ?? -->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI</name>
      <description>Wireless Fidelity control</description>
      <baseAddress>0x24B00000</baseAddress> <!-- todo: ?? -->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>>
    <peripheral>
      <name>EMAC</name>
      <description>Ethernet Media Access Control</description>
      <baseAddress>0x20070000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>mode</name>
          <description>Interface enables and configurations</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_source</name>
          <description>Interrupt source register</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-write</access>
          <!-- todo: don't generate write functions if defined like oneToClear -->
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>control_receive</name>
              <description>Control frame received interrupt state</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <name>InterruptState</name>
                <enumeratedValue>
                  <name>has_interrupt</name>
                  <description>Has interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_interrupt</name>
                  <description>No interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>control_transmit</name>
              <description>Control frame transmitted interrupt state</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>busy</name>
              <description>Lack of buffer interrupt state</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_error</name>
              <description>Receive error interrupt state</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>frame_received</name>
              <description>Frame received interrupt state</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transmit_error</name>
              <description>Transmit error interrupt state</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>buffer_transmitted</name>
              <description>Buffer transmitted interrupt state</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_mask</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-write</access>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>control_receive</name>
              <description>Control frame received interrupt mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <name>InterruptMask</name>
                <enumeratedValue>
                  <name>mask</name>
                  <description>Mask interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unmask</name>
                  <description>Unmask interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>control_transmit</name>
              <description>Control frame transmitted interrupt mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>busy</name>
              <description>Lack of buffer interrupt mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_error</name>
              <description>Receive error interrupt mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>frame_received</name>
              <description>Frame received interrupt mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transmit_error</name>
              <description>Transmit error interrupt mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>buffer_transmitted</name>
              <description>Buffer transmitted interrupt mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
          </fields>
        </register>
        <register>
          <name>backed_gap</name>
          <description>Back-to-back inter-packet gap register</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>non_backed_gap_1</name>
          <description>Non back-to-back inter-packet gap register 1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>non_backed_gap_2</name>
          <description>Non back-to-back inter-packet gap register 2</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>frame_length</name>
          <description>Minimum and maximum ethernet frame length</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>collision</name>
          <description>Collision time window and maximum retries</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>transmit_buffer</name>
          <description>Transmit buffer descriptor</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>flow_control</name>
          <description>Control frame function register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>mii_mode</name>
          <description>MII clock divider and premable enable</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>mii_command</name>
          <description>MII control data, read and scan state</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>mii_address</name>
          <description>Physical layer bus address</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>control_write</name>
          <description>Write data to MII physcial layer</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>control_read</name>
          <description>Read data from MII physcial layer</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>mii_state</name>
          <description>MII bus and link layer state</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>mac_address[%s]</name>
          <description>Media Access Control address</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>hash[%s]</name>
          <description>Hash register</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>transmit_control</name>
          <description>Transmit control register</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
