bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDH</name>
      <description>Secure Digital host control</description>
      <baseAddress>0x20060000</baseAddress>
      <!-- todo: sdk shows this peripheral is written by 16-bit register, confirm this -->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUDIO</name>
      <description>Audio codec controller</description>
      <baseAddress>0x20055000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Universal Serial Bus host</description>
      <baseAddress>0x20072000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <name>capability</name>
          <description>Host Controller Capability Registers</description>
          <addressOffset>0x000</addressOffset>
        </cluster>
        <cluster>
          <name>operation</name>
          <description>Host Controller Operational Registers</description>
          <addressOffset>0x010</addressOffset>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>PSRAM</name>
      <description>Pseudo Static Random Access Memory control</description>
      <baseAddress>0x20052000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- todo: EMI_MISC_BASE = 0x20050000 -->
    <peripheral>
      <name>AON</name>
      <description>Always-On function control</description>
      <baseAddress>0x2000F800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HBN</name>
      <description>Hibernate (Deep sleep) control</description>
      <baseAddress>0x2000F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>control</name>
          <description>Miscellaneous control register</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>time_lo</name>
          <description>Low bits of hibernate time</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>time_hi</name>
          <description>High bits of hibernate time</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>rtc_time_lo</name>
          <description>Low bits of Real-Time Clock time</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>rtc_time_hi</name>
          <description>High bits of Real-Time Clock time</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_mode</name>
          <description>Hibernate interrupt contol</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Hibernate interrupt state</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_clear</name>
          <description>Clear hibernate interrupt</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <!-- todo: HBN_PIR_CFG -->
        <!-- todo: HBN_PIR_VTH -->
        <!-- todo: HBN_PIR_INTERVAL -->
        <!-- todo: HBN_BOR_CFG -->
        <register>
          <name>global</name>
          <description>Global hibernate configuration</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>sram</name>
          <description>Static Random-Access Memory hibernate control</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <!-- todo: HBN_PAD_CTRL_0 -->
        <!-- todo: HBN_PAD_CTRL_1 -->
        <register>
          <name>rc32k</name>
          <description>32-kHz internal RC oscillator control</description>
          <addressOffset>0x200</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>xtal32k</name>
          <description>External crystal oscillator control</description>
          <addressOffset>0x204</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>rtc_control_0</name>
          <description>Real-Time Clock control and reset register 0</description>
          <addressOffset>0x208</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>rtc_control_1</name>
          <description>Real-Time Clock control and reset register 1</description>
          <addressOffset>0x20C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
