bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PDS</name>
      <description>Power-Down Sleep control</description>
      <baseAddress>0x2000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>touch_config</name>
          <description>??</description>
          <addressOffset>0xA00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>touch_channel</name>
          <description>??</description>
          <addressOffset>0xA04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>touch_process</name>
          <description>??</description>
          <addressOffset>0xA08</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>touch_sleep</name>
          <description>??</description>
          <addressOffset>0xA0C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>touch_delay</name>
          <description>??</description>
          <addressOffset>0xA10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>touch_force[%s]</name>
          <description>??</description>
          <addressOffset>0xA14</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>touch_voltage[%s]</name>
          <description>??</description>
          <addressOffset>0xA2C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>touch_raw[%s]</name>
          <description>??</description>
          <addressOffset>0xA38</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <!-- todo: Channel_LTA_data_0? -->
        <!-- todo: Channel_FLT_data_0? -->
        <register>
          <name>touch_interrupt_0</name>
          <description>??</description>
          <addressOffset>0xACC</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>touch_interrupt_1</name>
          <description>??</description>
          <addressOffset>0xAD0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <!-- todo: registers -->
      </registers>
    </peripheral>
    <peripheral>
      <dim>2</dim>
      <dimIncrement>0x65000</dimIncrement>
      <name>DMA%s</name>
      <description>Direct Memory Access</description>
      <baseAddress>0x2000C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Quad Serial Flash control</description>
      <baseAddress>0x2000B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LZ4D</name>
      <description>Hardware LZ4 Decompressor</description>
      <baseAddress>0x2000AD00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>config</name>
          <description>Decompressor peripheral configuration</description>
          <addressOffset>0x00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>enable</name>
              <description>Enable peripheral decompression</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>suspend</name>
              <description>Suspend peripheral decompression</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <!-- todo: what does lz4_checksum mean? -->
          </fields>
        </register>
        <!-- todo: what does src_fix and dst_fix mean? -->
        <register>
          <name>source_start</name>
          <description>Writes source address before decompression</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>start</name>
              <description>Start address</description>
              <lsb>0</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>base</name>
              <description>Address base</description>
              <lsb>26</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>source_end</name>
          <description>Reads the end address of source after decompression</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>end</name>
              <description>End of address</description>
              <lsb>0</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>destination_start</name>
          <description>Writes destination address before decompression</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>start</name>
              <description>Start address</description>
              <lsb>0</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>base</name>
              <description>Address base</description>
              <lsb>26</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>destination_end</name>
          <description>Reads the end address of destination after decompression</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>end</name>
              <description>End of address</description>
              <lsb>0</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_enable</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>done</name>
              <description>Decompliation finished</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <name>InterruptEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>error</name>
              <description>Error occurred while decompliation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <!-- todo: lz4_dst_int_en -->
            <!-- todo: lz4_dst_int_inv -->
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Interrupt state register</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>done</name>
              <description>Decompliation finished</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <name>InterruptState</name>
                <enumeratedValue>
                  <name>has_interrupt</name>
                  <description>Has interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_interrupt</name>
                  <description>No interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>error</name>
              <description>Error occurred while decompliation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <!-- todo: lz4_dst_int_sta -->
          </fields>
        </register>
        <!-- todo: lz4_cs in lz4_monitor -->
      </registers>
    </peripheral>
    <peripheral>
      <name>PDM</name>
      <description>Pulse Density Modulation</description>
      <baseAddress>0x2000AC00</baseAddress> <!-- todo: verify -->
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
