bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <description>Inter-IC Sound controller</description>
      <baseAddress>0x2000AB00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>config</name>
          <description>Function configuration register</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Interrupt enables, masks and states</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>base_clock</name>
          <description>Base clock divider</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>divide_high</name>
              <description>Higher half of base clock dividing factor</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>divide_low</name>
              <description>Lower half of base clock dividing factor</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>fifo_config_0</name>
          <description>FIFO configuration register 0</description>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>left_justified</name> <!-- todo proper name -->
              <description></description>
              <lsb>10</lsb>
              <msb>10</msb>
              <!-- todo access, writeConstraint, values-->
            </field>
            <field>
              <name>swap_left_right</name>
              <description></description>
              <lsb>9</lsb>
              <msb>9</msb>
              <!-- todo access, writeConstraint, values-->
            </field>
            <field>
              <name>merge_left_right</name>
              <description></description>
              <lsb>8</lsb>
              <msb>8</msb>
              <!-- todo access, writeConstraint, values-->
            </field>
            <field>
              <name>receive_underflow</name>
              <description>Receive FIFO underflow flag\n\n
Can be cleared using `receive_clear`.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>HasUnderflow</name>
                <enumeratedValue>
                  <name>not_underflow</name>
                  <description>No FIFO buffer underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>underflow</name>
                  <description>Has FIFO buffer underflow</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>receive_overflow</name>
              <description>Receive FIFO overflow flag\n\n
Can be cleared using `receive_clear`.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>HasOverflow</name>
                <enumeratedValue>
                  <name>not_overflow</name>
                  <description>No FIFO buffer overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overflow</name>
                  <description>Has FIFO buffer overflow</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_underflow</name>
              <description>Transmit FIFO underflow flag\n\n
Can be cleared using `transmit_clear`.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues derivedFrom="HasUnderflow" />
            </field>
            <field>
              <name>transmit_overflow</name>
              <description>Transmit FIFO overflow flag\n\n
Can be cleared using `transmit_clear`.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues derivedFrom="HasOverflow" />
            </field>
            <field>
              <name>receive_clear</name>
              <description>Clears receive FIFO overflow and underflow flags</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>FlagClear</name>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Write 1 to clear fifo flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_clear</name>
              <description>Clears transmit FIFO overflow and underflow flags</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues derivedFrom="FlagClear" />
            </field>
            <field>
              <name>receive_dma</name>
              <description>Enable signal of receive DMA interface</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>DmaEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable DMA interface</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable DMA interface</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_dma</name>
              <description>Enable signal of transmit DMA interface</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues derivedFrom="DmaEnable" />
            </field>
          </fields>
        </register>
        <register>
          <name>fifo_config_1</name>
          <description>FIFO configuration register 1</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>receive_threshold</name>
              <description>Receive FIFO threshold\n\n
DMA request will not be asserted if `receive_available` is less than this value</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>transmit_threshold</name>
              <description>Transmit FIFO threshold\n\n
DMA request will not be asserted if `transmit_available` is less than this value</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>receive_count</name>
              <description>Count of available data in receive FIFO</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>transmit_count</name>
              <description>Count of available data in transmit FIFO</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>data_write</name>
          <description>FIFO write data register</description>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>write-only</access>
          <fields>
            <field>
              <name>value</name>
              <description>Write data to FIFO</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>data_read</name>
          <description>FIFO read data register</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>value</name>
              <description>Read data from FIFO</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
