bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ISO11898</name>
      <description>ISO 11898 communication protocol</description>
      <baseAddress>0x2000AA00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IPC</name>
      <description>Inter-processor Channel</description>
      <baseAddress>0x2000A800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- todo: CKS_BASE = 0x2000A700 -->
    <peripheral>
      <name>IR</name>
      <description>Infrared Remote module</description>
      <baseAddress>0x2000A600</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>transmit_config</name>
          <description>??</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>transmit_interrupt</name>
          <description>??</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>transmit_data[%s]</name>
          <description>??</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>transmit_width</name>
          <description>??</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>receive_config</name>
          <description>??</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>receive_interrupt</name>
          <description>??</description>
          <addressOffset>0x84</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>receive_width</name>
          <description>??</description>
          <addressOffset>0x88</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>receive_bit_count</name>
          <description>??</description>
          <addressOffset>0x90</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>receive_data[%s]</name>
          <description>??</description>
          <addressOffset>0x94</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER</name>
      <description>Timer control</description>
      <baseAddress>0x2000A500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <description>Pulse-Width Modulation module</description>
      <baseAddress>0x2000A400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>config_0</name>
          <description>Configuration register 0</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>config_1</name> <!-- todo: more proper name -->
          <description>Configuration register 1</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>period</name>
          <description>Cycle duration in clock source cycles</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dead_time</name>
          <description>??</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>channel_threshold[%s]</name>
          <description>??</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Interrut state register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_mask</name>
          <description>Interrut mask register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_clear</name>
          <description>Clear interrupt register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_enable</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
