bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <dim>2</dim>
      <dimIncrement>0x600</dimIncrement>
      <name>I2C[%s]</name>
      <description>Inter-Integrated Circuit bus</description>
      <baseAddress>0x2000A300</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>config</name>
          <description>Function configuration register</description>
          <addressOffset>0x00</addressOffset>
          <resetValue>0x0000000a</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>deglitch_cycle</name>
              <description>De-glitch function cycle count</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>packet_length</name>
              <description>Byte count for each packet</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>slave_address</name>
              <description>I2C transaction slave address</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>sub_address_length</name>
              <description>Byte count for I2C sub-address</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>one</name>
                  <description>Sub-addresses include 1 byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Sub-addresses include 2 bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>three</name>
                  <description>Sub-addresses include 3 bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>four</name>
                  <description>Sub-addresses include 4 bytes</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sub_address_enable</name>
              <description>Enable sub-address fields</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable sub-address fields</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable sub-address fields</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>clock_synchronize</name>
              <description>Enable I2C clock synchronization\n\n
Enable this bit to support multi-master and clock-stretching. It should not be turned-off normally.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable clock synchronization</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable clock synchronization</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>deglitch_enable</name>
              <description>Enable de-glitch function on all input pins</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable de-glitch function on inputs</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable de-glitch function on inputs</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transfer_direction</name>
              <description>Packet transfer direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write from master side</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read from master side</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>master_enable</name>
              <description>Enable signal of I2C master function\n\n
Asserting this bit will trigger the transaction, and should be de-asserted after finish.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable I2C master function</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable I2C master function</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt</name>
          <description>Interrupt enables, states and masks</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x3f003f00</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>fifo_error_enable</name>
              <description>Transmit or receive FIFO error interrupt enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <name>InterruptEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>arbitrate_lost_enable</name>
              <description>Arbitration lost interrupt enable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>not_acknowledged_enable</name>
              <description>Not-acknowledged response interrupt enable</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_fifo_ready_enable</name>
              <description>Receive FIFO ready interrupt enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>transmit_fifo_ready_enable</name>
              <description>Transmit FIFO ready interrupt enable</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>transfer_end_enable</name>
              <description>Transfer ended interrupt enable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>arbitrate_lost_clear</name>
              <description>Write 1 to clear arbitration lost</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>write-only</access>
              <enumeratedValues>
                <name>InterruptClear</name>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Write 1 to clear interrupt state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>not_acknowledged_clear</name>
              <description>Write 1 to clear not-acknowledged response</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>write-only</access>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>transfer_end_clear</name>
              <description>Write 1 to clear transfer ended</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>fifo_error_mask</name>
              <description>Transmit or receive FIFO error interrupt mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <name>InterruptMask</name>
                <enumeratedValue>
                  <name>mask</name>
                  <description>Mask interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unmask</name>
                  <description>Unmask interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>arbitrate_lost_mask</name>
              <description>Arbitration lost interrupt mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>not_acknowledged_mask</name>
              <description>Not-acknowledged response interrupt mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_fifo_ready_mask</name>
              <description>Receive FIFO ready interrupt mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transmit_fifo_ready_mask</name>
              <description>Transmit FIFO ready interrupt mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transfer_end_mask</name>
              <description>Transfer ended interrupt mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>fifo_error_state</name>
              <description>Transmit or receive FIFO error interrupt state\n\n
Auto cleared when FIFO overflow or underflow error flag is cleared.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <name>InterruptState</name>
                <enumeratedValue>
                  <name>has_interrupt</name>
                  <description>Has interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_interrupt</name>
                  <description>No interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>arbitrate_lost_state</name>
              <description>Arbitration lost interrupt state</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>not_acknowledged_state</name>
              <description>Not-acknowledged response interrupt state</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_fifo_ready_state</name>
              <description>Receive FIFO ready interrupt state\n\n
Auto cleared when data is popped from receive FIFO.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transmit_fifo_ready_state</name>
              <description>Transmit FIFO ready interrupt state\n\n
Auto cleared when data is pushed into transmit FIFO.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transfer_end_state</name>
              <description>Transfer ended interrupt state</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
          </fields>
        </register>
        <register>
          <name>sub_address</name>
          <description>Register address of slave device</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>8</dimIncrement>
              <name>byte[%s]</name>
              <description>I2C sub-address byte %s</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>bus_busy</name>
          <description>Bus busy state indicator</description>
          <addressOffset>0x0C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>force_clear</name>
              <description>Force clear I2C bus busy state\n\n
Not for normal use; only use when I2C bus hangs</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Write 1 to force clear busy flag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>busy</name>
              <description>Indicator to I2C bus busy signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Bus is busy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Bus is not busy</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>period_start</name>
          <description>Duration of start phase</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x0f0f0f0f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>8</dimIncrement>
              <name>phase[%s]</name>
              <description>Length of start condition phase %s</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>period_stop</name>
          <description>Duration of stop phase</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x0f0f0f0f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>8</dimIncrement>
              <name>phase[%s]</name>
              <description>Length of stop condition phase %s</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>period_data</name>
          <description>Duration of data phase</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x0f0f0f0f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>8</dimIncrement>
              <name>phase[%s]</name>
              <description>Length of data condition phase %s</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
