bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <dim>1</dim>
      <dimIncrement>0x100</dimIncrement>
      <name>SPI[%s]</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x2000A200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>config</name>
          <description>Function configuration register</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Interrupt enables, masks and states</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>bus_busy</name>
          <description>Bus busy state indicator</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>period_control</name>
          <description>Duration of control signals</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>period_interval</name>
          <description>Interval bitween frames</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>ignore_index</name>
          <description>Receive ignore index configuration</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>timeout</name>
          <description>Slave mode transmit timeout values</description>
          <addressOffset>0x1c</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>fifo_config_0</name>
          <description>FIFO configuration register 0</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>fifo_config_1</name>
          <description>FIFO configuration register 1</description>
          <addressOffset>0x84</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>data_write</name>
          <description>FIFO write data register</description>
          <addressOffset>0x88</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>data_read</name>
          <description>FIFO read data register</description>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <dim>2</dim>
      <dimIncrement>0x100</dimIncrement>
      <name>UART[%s]</name>
      <description>Universal Asynchronous Receiver Transmitter</description>
      <baseAddress>0x2000A000</baseAddress>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>transmit_config</name>
          <description>Transmit configuration register</description>
          <addressOffset>0x00</addressOffset>
          <resetValue>0x00008f00</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>transfer_length</name>
              <description>Length of words per UART transmit transfer\n\n
This field is ignored when `freerun` mode is enabled.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>break_bits</name>
              <description>Number of break bits for LIN protocol</description>
              <lsb>13</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>stop_bits</name>
              <description>Number of stop bits</description>
              <lsb>11</lsb>
              <msb>12</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero_p_five</name>
                  <description>0.5 stop bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>1 stop bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one_p_five</name>
                  <description>1.5 stop bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>2 stop bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>word_length</name>
              <description>Bit count for each transmit data word</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>five</name>
                  <description>Each word includes 5 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>six</name>
                  <description>Each word includes 6 bits</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>seven</name>
                  <description>Each word includes 7 bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eight</name>
                  <description>Each word includes 8 bits</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ir_inverse</name>
              <description>Inverse transmit signal output in IR mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inverse</name>
                  <description>Inverse transmit input in IR mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_inverse</name>
                  <description>Don't inverse transmit input in IR mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ir_transmit</name>
              <description>Enable IR transmit mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable IR transmit mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable IR transmit mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>parity_mode</name>
              <description>Select transmit parity mode if enabled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>odd</name>
                  <description>Odd parity if `parity_enable` is set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>even</name>
                  <description>Even parity if `parity_enable` is set</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>parity_enable</name>
              <description>Enable transmit parity check</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable transmit parity check</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable transmit parity check</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>lin_transmit</name>
              <description>Local Interconnect Network protocol enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable Local Interconnect Network protocol</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable Local Interconnect Network protocol</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>freerun</name>
              <description>Enable freerun mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable freerun mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable freerun mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>cts</name>
              <description>Enable Clear-to-Send flow control signal</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable Clear-to-Send flow control signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable Clear-to-Send flow control signal</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>function</name>
              <description>Enable transmit function</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable UART receive function signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable UART receive function signal</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>receive_config</name>
          <description>Receive configuration register</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x00000700</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>transfer_length</name>
              <description>Length of words per UART receive transfer</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>deglitch_cycle</name>
              <description>De-glitch function cycle count</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>deglitch_enable</name>
              <description>Enable receive de-glitch function</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable de-glitch function upon receive</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable de-glitch function upon receive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>word_length</name>
              <description>Bit count for each receive data word</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>five</name>
                  <description>Each word includes 5 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>six</name>
                  <description>Each word includes 6 bits</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>seven</name>
                  <description>Each word includes 7 bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eight</name>
                  <description>Each word includes 8 bits</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ir_inverse</name>
              <description>Inverse receive signal output in IR mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inverse</name>
                  <description>Inverse receive input in IR mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_inverse</name>
                  <description>Don't inverse receive input in IR mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ir_receive</name>
              <description>Enable IR receive mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable IR receive mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable IR receive mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>parity_mode</name>
              <description>Select receive parity mode if enabled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>odd</name>
                  <description>Odd parity if `parity_enable` is set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>even</name>
                  <description>Even parity if `parity_enable` is set</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>parity_enable</name>
              <description>Enable receive parity check</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable receive parity check</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable receive parity check</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>lin_receive</name>
              <description>Local Interconnect Network protocol enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable Local Interconnect Network protocol</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable Local Interconnect Network protocol</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>auto_baudrate</name>
              <description>Enable receive auto baudrate detection</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable auto baudrate upon receive</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable auto baudrate upon receive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>function</name>
              <description>Enable receive function</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable UART receive function signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable UART receive function signal</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>bit_period</name>
          <description>Bit period control register</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00ff00ff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>receive</name>
              <description>Period of each receive bit\n\n
Add 1 to this value and divide by clock to get receive baudrate.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>transmit</name>
              <description>Period of each transmit bit\n\n
Add 1 to this value and divide by clock to get transmit baudrate.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
