bouffalolab/bl808-pac/bl808.svd
        <register>
          <name>data_config</name>
          <description>Data configuration register</description>
          <addressOffset>0x0C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>bit_order</name>
              <description>Enable bit inverse in each data word</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inverse</name>
                  <description>Each byte is sent out MSB-first</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_inverse</name>
                  <description>Each byte is sent out LSB-first</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>transmit_position</name>
          <description>IR-mode transmit position control</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x009f0070</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>stop</name>
              <description>Stop position of transmit IR pulse</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>start</name>
              <description>Start position of transmit IR pulse</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>receive_position</name>
          <description>IR-mode receive position control</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x0000006f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>start</name>
              <description>Start position of received pulse recovered from IR signal</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>receive_timeout</name>
          <description>Receive Time-Out interrupt control</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x0000000f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>value</name>
              <description>Timeout interrupt triggering value by bits received</description>
              <!-- todo: what's 'bit time'? -->
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>signal_override</name>
          <description>Manual override of flow control signal</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>rts_value</name>
              <description>Value to override Request-to-Send signal if override is enabled</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <name>SignalAssert</name>
                <enumeratedValue>
                  <name>high</name>
                  <description>Assert this signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low</name>
                  <description>Deassert this signal</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rts_signal</name>
              <description>Enable manual override of Request-to-Send flow control signal</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <name>OverrideEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable manual override of this signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable manual override of this signal</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_value</name>
              <description>Value to override transmit signal if override is enabled</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="rts_value.SignalAssert" />
            </field>
            <field>
              <name>transmit_signal</name>
              <description>Enable manual override of transmit signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="rts_signal.OverrideEnable" />
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_state</name>
          <description>Interrupt state register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000004</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>auto_baudrate_five_five</name>
              <description>Receive auto baudrate detection finished using 0x55 occurred</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <name>InterruptState</name>
                <enumeratedValue>
                  <name>has_interrupt</name>
                  <description>Has interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_interrupt</name>
                  <description>No interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>auto_baudrate_start_bit</name>
              <description>Receive auto baudrate detection finished using start bit occurred</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_byte_count</name>
              <description>Receive byte count reached occurred</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_sync_error</name>
              <description>Receive LIN mode synchronization field error occurred</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_fifo_error</name>
              <description>Receive FIFO overflow or underflow occurred</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transmit_fifo_error</name>
              <description>Transmit FIFO overflow or underflow occurred</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_parity</name>
              <description>Receive parity check failure occurred</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_timeout</name>
              <description>Receive timed-out interrupt occurred</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_fifo_ready</name>
              <description>Receive FIFO ready signal raised</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transmit_fifo_ready</name>
              <description>Transmit FIFO ready signal raised</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>receive_transfer</name>
              <description>Receive transfer finish signal raised</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
            <field>
              <name>transmit_transfer</name>
              <description>Transmit transfer finish signal raised</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptState" />
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_mask</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00000fff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>auto_baudrate_five_five</name>
              <description>Receive auto baudrate detection finished using 0x55 occurred</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <name>InterruptMask</name>
                <enumeratedValue>
                  <name>mask</name>
                  <description>Mask interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unmask</name>
                  <description>Unmask interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>auto_baudrate_start_bit</name>
              <description>Receive auto baudrate detection finished using start bit interrupt mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_byte_count</name>
              <description>Receive byte count reached interrupt mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_sync_error</name>
              <description>Receive LIN mode synchronization field error interrupt mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_fifo_error</name>
              <description>Receive FIFO overflow or underflow interrupt mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transmit_fifo_error</name>
              <description>Transmit FIFO overflow or underflow interrupt mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_parity</name>
              <description>Receive parity check failure interrupt mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_timeout</name>
              <description>Receive timed-out interrupt mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_fifo_ready</name>
              <description>Receive FIFO ready signal interrupt mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transmit_fifo_ready</name>
              <description>Transmit FIFO ready signal interrupt mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>receive_transfer</name>
              <description>Receive transfer finish signal interrupt mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
            <field>
              <name>transmit_transfer</name>
              <description>Transmit transfer finish signal interrupt mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptMask" />
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_clear</name>
          <description>Clear interrupt register</description>
          <addressOffset>0x28</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>write-only</access>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>auto_baudrate_five_five</name>
              <description>Write 1 to clear receive auto baudrate detection finished using 0x55</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <name>InterruptClear</name>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Write 1 to clear interrupt state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>auto_baudrate_start_bit</name>
              <description>Write 1 to clear receive auto baudrate detection finished using start bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>receive_byte_count</name>
              <description>Write 1 to clear receive byte count reached</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>receive_sync_error</name>
              <description>Write 1 to clear receive LIN mode synchronization field error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>receive_parity</name>
              <description>Write 1 to clear receive parity check failure</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>receive_timeout</name>
              <description>Write 1 to clear receive timed-out</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>receive_transfer</name>
              <description>Write 1 to clear receive transfer finish signal</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
            <field>
              <name>transmit_transfer</name>
              <description>Write 1 to clear transmit transfer finish signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptClear" />
            </field>
          </fields>
        </register>
        <register>
          <name>interrupt_enable</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0x000000ff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>auto_baudrate_five_five</name>
              <description>Receive auto baudrate detection finished using 0x55 interrupt enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <name>InterruptEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>auto_baudrate_start_bit</name>
              <description>Receive auto baudrate detection finished using start bit interrupt enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_byte_count</name>
              <description>Receive byte count reached interrupt enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_sync_error</name>
              <description>Receive LIN mode synchronization field error interrupt enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_fifo_error</name>
              <description>Receive FIFO overflow or underflow interrupt enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>transmit_fifo_error</name>
              <description>Transmit FIFO overflow or underflow interrupt enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_parity</name>
              <description>Receive parity check failure interrupt enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_timeout</name>
              <description>Receive timed-out interrupt enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_fifo_ready</name>
              <description>Receive FIFO ready signal interrupt enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>transmit_fifo_ready</name>
              <description>Transmit FIFO ready signal interrupt enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>receive_transfer</name>
              <description>Receive transfer signal interrupt enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
            <field>
              <name>transmit_transfer</name>
              <description>Transmit transfer signal interrupt enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="InterruptEnable" />
            </field>
          </fields>
        </register>
        <register>
          <name>bus_state</name>
          <description>Bus state register</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>receive_busy</name>
              <description>Indicates that UART receive bus is busy</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <name>BusBusy</name>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Bus is busy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Bus is not busy</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_busy</name>
              <description>Indicates that UART transmit bus is busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="BusBusy" />
            </field>
          </fields>
        </register>
