bouffalolab/bl808-pac/bl808.svd
        <register>
          <name>auto_baudrate</name>
          <description>Auto baudrate detection register</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>by_five_five</name>
              <description>Bit period of auto baudrate detection using codeword 0x55</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
            <field>
              <name>by_start_bit</name>
              <description>Bit period of auto baudrate detection using start bit</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <!-- todo:  
        related to auto baudrate
        /* 0x38 : urx_abr_prd_b01 */
        /* 0x3C : urx_abr_prd_b23 */
        /* 0x40 : urx_abr_prd_b45 */
        /* 0x44 : urx_abr_prd_b67 */
        -->
        <register>
          <name>pulse_tolerance</name>
          <description>Pulse width tolerance for auto baudrate</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>by_five_five</name>
              <description>Pulse width tolerance of auto baudrate detection using codeword 0x55</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <!-- todo: 0x50: urx_bcr_int_cfg -->
        <register>
          <name>rs485_transmit</name>
          <description>RS-485 mode transmit configuration</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>polarity</name>
              <description>RS-485 pin polarity of Driver Enable (DE) pin</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <name>Polarity</name>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Driver Enable (DE) pin is active high</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Driver Enable (DE) pin is active low</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>function</name>
              <description>RS-485 transceiver mode enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable RS-485 transceiver mode
The peripheral is connected to RS-485 transceiver, and RTS signal output becomes Driver Enable (DE) signal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable RS-485 transceiver mode
The peripheral operates as normal UART.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>fifo_config_0</name>
          <description>FIFO configuration register 0</description>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <name>receive_underflow</name>
              <description>Receive FIFO underflow flag\n\n
Can be cleared using `receive_clear`.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <name>HasUnderflow</name>
                <enumeratedValue>
                  <name>not_underflow</name>
                  <description>No FIFO buffer underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>underflow</name>
                  <description>Has FIFO buffer underflow</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>receive_overflow</name>
              <description>Receive FIFO overflow flag\n\n
Can be cleared using `receive_clear`.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <name>HasOverflow</name>
                <enumeratedValue>
                  <name>not_overflow</name>
                  <description>No FIFO buffer overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overflow</name>
                  <description>Has FIFO buffer overflow</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_underflow</name>
              <description>Transmit FIFO underflow flag\n\n
Can be cleared using `transmit_clear`.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="HasUnderflow" />
            </field>
            <field>
              <name>transmit_overflow</name>
              <description>Transmit FIFO overflow flag\n\n
Can be cleared using `transmit_clear`.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues derivedFrom="HasOverflow" />
            </field>
            <field>
              <name>receive_clear</name>
              <description>Clears receive FIFO overflow and underflow flags</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <enumeratedValues>
                <name>FlagClear</name>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Write 1 to clear fifo flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_clear</name>
              <description>Clears transmit FIFO overflow and underflow flags</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <enumeratedValues derivedFrom="FlagClear" />
            </field>
            <field>
              <name>receive_dma</name>
              <description>Enable signal of receive DMA interface</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <name>DmaEnable</name>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable DMA interface</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable DMA interface</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>transmit_dma</name>
              <description>Enable signal of transmit DMA interface</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues derivedFrom="DmaEnable" />
            </field>
          </fields>
        </register>
        <register>
          <name>fifo_config_1</name>
          <description>FIFO configuration register 1</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>receive_threshold</name>
              <description>Receive FIFO threshold\n\n
DMA request will not be asserted if `receive_available` is less than this value</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>transmit_threshold</name>
              <description>Transmit FIFO threshold\n\n
DMA request will not be asserted if `transmit_available` is less than this value</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>receive_count</name>
              <description>Count of available data in receive FIFO</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>transmit_count</name>
              <description>Count of available data in transmit FIFO</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>data_write</name>
          <description>FIFO write data register</description>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>write-only</access>
          <fields>
            <field>
              <name>value</name>
              <description>Write data to FIFO</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>data_read</name>
          <description>FIFO read data register</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <access>read-only</access>
          <fields>
            <field>
              <name>value</name>
              <description>Read data from FIFO</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
