bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MISC</name>
      <description>Chip Miscellaneous control</description>
      <baseAddress>0x20009000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CCI</name>
      <description>Camera Control Interface</description> <!-- todo verify -->
      <baseAddress>0x20008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EFUSE</name>
      <description>eFuse memory control</description>
      <baseAddress>0x20056000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- todo: TRUST_NS = 0x20006000? -->
    <!-- todo: TRUST_S = 0x20005000? -->
    <peripheral>
      <name>SEC</name>
      <description>Secure Engine</description>
      <baseAddress>0x20004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DEBUG</name>
      <description>Secure debug configuration</description>
      <baseAddress>0x20003000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>identify[%s]</name>
          <description>Unique module identifier</description>
          <addressOffset>0x00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>word</name>
              <description>Read identifier part in word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>password[%s]</name>
          <description>Password of debug module</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>word</name>
              <description>Read or write password in word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>control</name>
          <description>Module control register</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>password_busy</name>
              <description>??</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>password_trigger</name>
              <description>??</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <!-- todo: sd_dbg_cci_read_en -->
            <!-- todo: sd_dbg_cci_clk_sel -->
            <field>
              <name>password_count</name>
              <description>??</description>
              <lsb>4</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>debug_mode</name>
              <description>??</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>debug_enable</name>
              <description>Read if debug module is enabled</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AGC</name>
      <description>Automatic Gain Control</description>
      <baseAddress>0x20002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size> <!-- todo -->
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- todo: PHY_BASE = 0x20002800? -->
    <peripheral>
      <name>GPIP</name>
      <description>Generic DAC, ADC and ACOMP interface control</description>
      <baseAddress>0x20002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
