bouffalolab/bl808-pac/bl808.svd
      </registers>
    </peripheral>
    <!-- todo: MIX_BASE = 0x20001000? -->
    <peripheral>
      <name>GLB</name>
      <description>Global configuration register</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>chip_inform</name>
          <description>Chip information register</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_16</name>
          <description>Core configuration register 16</description>
          <addressOffset>0x050</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_17</name>
          <description>Core configuration register 17</description>
          <addressOffset>0x054</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_18</name>
          <description>Core configuration register 18</description>
          <addressOffset>0x058</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_19</name>
          <description>Core configuration register 19</description>
          <addressOffset>0x05C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_20</name>
          <description>Core configuration register 20</description>
          <addressOffset>0x060</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_21</name>
          <description>Core configuration register 21</description>
          <addressOffset>0x064</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_22</name>
          <description>Core configuration register 22</description>
          <addressOffset>0x068</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_23</name>
          <description>Core configuration register 23</description>
          <addressOffset>0x06C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_24</name>
          <description>Core configuration register 24</description>
          <addressOffset>0x070</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>core_config_25</name>
          <description>Core configuration register 25</description>
          <addressOffset>0x074</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>sys_config_0</name>
          <description>System configuration register 0</description>
          <addressOffset>0x090</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>sys_config_1</name>
          <description>System configuration register 1</description>
          <addressOffset>0x094</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>bus_config_0</name>
          <description>Bus configuration register 0</description>
          <addressOffset>0x0A0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>emi_config</name> <!-- todo: 是我理解的那个EMI吗？ -->
          <description>Electromagnetic interference configuration</description>
          <addressOffset>0x0E0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>rtc_config</name>
          <description>Real-time clock configuration</description>
          <addressOffset>0x0F0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>adc_config</name>
          <description>Analog-to-digital convert configuration</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dac_config_0</name>
          <description>Digital-to-analog convert configuration 0</description>
          <addressOffset>0x120</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dac_config_1</name>
          <description>Digital-to-analog convert configuration 1</description>
          <addressOffset>0x124</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dac_config_2</name>
          <description>Digital-to-analog convert configuration 2</description>
          <addressOffset>0x128</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dac_config_3</name>
          <description>Digital-to-analog convert configuration 3</description>
          <addressOffset>0x12C</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dma_config_0</name>
          <description>Direct memory access configuration 0</description>
          <addressOffset>0x130</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dma_config_1</name>
          <description>Direct memory access configuration 1</description>
          <addressOffset>0x134</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>dma_config_2</name>
          <description>Direct memory access configuration 2</description>
          <addressOffset>0x138</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>ir_config_0</name>
          <description>Infrared configuration register 0</description>
          <addressOffset>0x140</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>ir_config_1</name>
          <description>Infrared configuration register 1</description>
          <addressOffset>0x144</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>uart_config</name>
          <description>Universal Asynchronous Receiver/Transmitter configuration</description>
          <addressOffset>0x150</addressOffset>
          <fields>
            <field>
              <name>clock_divide</name>
              <description>Peripheral clock divide factor</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>clock_enable</name>
              <description>Peripheral level clock gate enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>hibernate_clock_source</name>
              <description>Reads clock source from hibernate registers</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>hibernate_clock_source_2</name>
              <description>Reads clock source from hibernate registers</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>uart2_mode</name>
              <description>Select interface mode for UART2 peripheral</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>Uart2Mode</name>
                <enumeratedValue>
                  <name>uart</name>
                  <description>Universal Asynchronous Receiver/Transmitter interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iso11898</name>
                  <description>ISO 11898 communication protocol interface</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>uart_signal_0</name>
          <description>Universal Asynchronous Receiver/Transmitter signal configuration 0</description>
          <addressOffset>0x154</addressOffset>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <name>function_0[%s]</name>
              <description>Select peripheral function for UART signal %s</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <name>Function</name>
                <enumeratedValue>
                  <name>uart0_rts</name>
                  <description>UART0 Request-to-Send flow control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_cts</name>
                  <description>UART0 Clear-to-Send flow control</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_txd</name>
                  <description>UART0 transmit data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_rxd</name>
                  <description>UART0 receive data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart1_rts</name>
                  <description>UART1 Request-to-Send flow control</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart1_cts</name>
                  <description>UART1 Clear-to-Send flow control</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart1_txd</name>
                  <description>UART1 transmit data</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart1_rxd</name>
                  <description>UART1 receive data</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart2_rts</name>
                  <description>UART2 Request-to-Send flow control</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart2_cts</name>
                  <description>UART2 Clear-to-Send flow control</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart2_txd</name>
                  <description>UART2 transmit data</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart2_rxd</name>
                  <description>UART2 receive data</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>uart_signal_1</name>
          <description>Universal Asynchronous Receiver/Transmitter signal configuration 1</description>
          <addressOffset>0x158</addressOffset>
          <writeConstraint>
            <useEnumeratedValues>true</useEnumeratedValues>
          </writeConstraint>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>4</dimIncrement>
              <name>function_1[%s]</name>
              <description>Select peripheral function for UART signal %s (offset by 8)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues derivedFrom="uart_signal_0.function_0[%s].Function" />
            </field>
          </fields>
        </register>
        <register>
          <name>flash_config</name>
          <description>Serial flash configuration</description>
          <addressOffset>0x170</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>i2c_config</name>
          <description>Inter-Integrated Circuit bus configuration</description>
          <addressOffset>0x180</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>i2s_config</name>
          <description>Inter-IC Sound configuration</description>
          <addressOffset>0x190</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>spi_config</name>
          <description>Serial Peripheral Interface configuration</description>
          <addressOffset>0x1B0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>quad_config</name>
          <description>Quadrature decoder configuration</description>
          <addressOffset>0x1C0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>digit_clock_0</name>
          <description>Digital clock configuration 0</description>
          <addressOffset>0x250</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>digit_clock_1</name>
          <description>Digital clock configuration 1</description>
          <addressOffset>0x254</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>digit_clock_2</name>
          <description>Digital clock configuration 2</description>
          <addressOffset>0x258</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>radio_config</name>
          <description>Radio configuration register</description>
          <addressOffset>0x260</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>debug_config_0</name>
          <description>Debug configuration register 0</description>
          <addressOffset>0x2E0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>debug_config_1</name>
          <description>Debug configuration register 1</description>
          <addressOffset>0x2E4</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>debug_config_2</name>
          <description>Debug configuration register 2</description>
          <addressOffset>0x2E8</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>debug_config_3</name>
          <description>Debug configuration register 3</description>
          <addressOffset>0x2EC</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>debug_config_4</name>
          <description>Debug configuration register 4</description>
          <addressOffset>0x2F0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>test_mode</name>
          <description>Memory Built-in Self Test mode</description>
          <addressOffset>0x300</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>test_done</name>
          <description>Memory Built-in Self Test done state</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
        <register>
          <name>test_fail</name>
          <description>Memory Built-in Self Test fail state</description>
          <addressOffset>0x310</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
